# SERIES

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}
# dict = 'a', key 10, value

In [12]:
pd.Series(data = my_list)

0    10
1    20
2    30
dtype: int64

In [13]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [14]:
arr

array([10, 20, 30])

In [15]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [16]:
pd.Series(arr, labels)
# labels = key
#  arr = value

a    10
b    20
c    30
dtype: int32

In [17]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [22]:
ser1 = pd.Series([1, 2, 3, 4],index=['USA', 'Germany', 'USSR', 'Japan'])

In [23]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [25]:
ser2 = pd.Series([1, 2, 5, 4],index=['USA', 'Germany', 'Italy', 'Japan'])

In [26]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [27]:
ser1['USA']

1

In [28]:
ser1 + ser2
# Nan = gaada, angkaa + nan = nan

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DATA FRAMES

In [29]:
import pandas as pd
import numpy as np

In [30]:
from numpy.random import randn
np.random.seed(101)

In [34]:
df = pd.DataFrame(randn(5,4),
                  index='A B C D E'.split(),
                  columns='W X Y Z'.split())

In [35]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [36]:
df['X']
# Index , Value
# Series

A    1.693723
B    0.390528
C    0.072960
D   -0.754070
E    1.901755
Name: X, dtype: float64

In [37]:
df[['X']]
# Data Frame

          X
A  1.693723
B  0.390528
C  0.072960
D -0.754070
E  1.901755

In [38]:
df['O'] = df['Z'] - df['Y']
# membuat kolom baru berdasarkan selisih dari kedua kolom

In [39]:
df

          W         X         Y         Z         O
A  0.302665  1.693723 -1.706086 -1.159119  0.546967
B -0.134841  0.390528  0.166905  0.184502  0.017597
C  0.807706  0.072960  0.638787  0.329646 -0.309141
D -0.497104 -0.754070 -0.943406  0.484752  1.428158
E -0.116773  1.901755  0.238127  1.996652  1.758525

In [40]:
df.drop('X',axis=1)
# menghilangkan kolom X
# untuk menghapus 2 kolom sekaligus tambahkan list
# axis untuk menghapus seluruh kolom (selalu 1)

          W         Y         Z         O
A  0.302665 -1.706086 -1.159119  0.546967
B -0.134841  0.166905  0.184502  0.017597
C  0.807706  0.638787  0.329646 -0.309141
D -0.497104 -0.943406  0.484752  1.428158
E -0.116773  0.238127  1.996652  1.758525

In [41]:
df

          W         X         Y         Z         O
A  0.302665  1.693723 -1.706086 -1.159119  0.546967
B -0.134841  0.390528  0.166905  0.184502  0.017597
C  0.807706  0.072960  0.638787  0.329646 -0.309141
D -0.497104 -0.754070 -0.943406  0.484752  1.428158
E -0.116773  1.901755  0.238127  1.996652  1.758525

In [50]:
df.drop('X',axis=1,inplace=True)
# menghilangkan x secara permanen
# atau df.drop('X',axis=1, inplace=True)

KeyError: "['X'] not found in axis"

In [51]:
df

          W         Y         Z         O
A  0.302665 -1.706086 -1.159119  0.546967
B -0.134841  0.166905  0.184502  0.017597
C  0.807706  0.638787  0.329646 -0.309141
D -0.497104 -0.943406  0.484752  1.428158

In [48]:
df.drop('E',axis=0,inplace=True)
# menghapus baris
# Axis = 0

In [49]:
df

          W         Y         Z         O
A  0.302665 -1.706086 -1.159119  0.546967
B -0.134841  0.166905  0.184502  0.017597
C  0.807706  0.638787  0.329646 -0.309141
D -0.497104 -0.943406  0.484752  1.428158

In [53]:
df.loc[['A']]
# mengakses baris tertentu
# loc = location

          W         Y         Z         O
A  0.302665 -1.706086 -1.159119  0.546967

In [54]:
df.iloc[[2]]
# iloc = index location
# c merupakan index ke-2

          W         Y         Z         O
C  0.807706  0.638787  0.329646 -0.309141

In [57]:
df.loc[['A', 'B'], ['Y', 'Z']]
# [[Baris],[Kolom]]

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502

In [58]:
df.iloc[[1,2],[1,2]]

          Y         Z
B  0.166905  0.184502
C  0.638787  0.329646

In [59]:
df

          W         Y         Z         O
A  0.302665 -1.706086 -1.159119  0.546967
B -0.134841  0.166905  0.184502  0.017597
C  0.807706  0.638787  0.329646 -0.309141
D -0.497104 -0.943406  0.484752  1.428158

In [60]:
df>0

       W      Y      Z      O
A   True  False  False   True
B  False   True   True   True
C   True   True   True  False
D  False  False   True   True

In [62]:
df

          W         Y         Z         O
A  0.302665 -1.706086 -1.159119  0.546967
B -0.134841  0.166905  0.184502  0.017597
C  0.807706  0.638787  0.329646 -0.309141
D -0.497104 -0.943406  0.484752  1.428158

In [63]:
df[df>0]

          W         Y         Z         O
A  0.302665       NaN       NaN  0.546967
B       NaN  0.166905  0.184502  0.017597
C  0.807706  0.638787  0.329646       NaN
D       NaN       NaN  0.484752  1.428158

In [74]:
df[df['W']>0]
# Harus kolom
# mengambil baris yang sesuai dengan kondisi yang ditentukan

          W         Y         Z         O
A  0.302665 -1.706086 -1.159119  0.546967
C  0.807706  0.638787  0.329646 -0.309141

In [77]:
df[df['W']>0][['W']]
# mengambil kolom spesisifik

          W
A  0.302665
C  0.807706

In [78]:
df

          W         Y         Z         O
A  0.302665 -1.706086 -1.159119  0.546967
B -0.134841  0.166905  0.184502  0.017597
C  0.807706  0.638787  0.329646 -0.309141
D -0.497104 -0.943406  0.484752  1.428158

In [79]:
df[(df['Y'] < -1) & (df['Z'] > 0)]

Empty DataFrame
Columns: [W, Y, Z, O]
Index: []

In [80]:
df[(df['Y'] < -1) | (df['Z'] > 0)]
# | = or karena binary gabisa pake or

          W         Y         Z         O
A  0.302665 -1.706086 -1.159119  0.546967
B -0.134841  0.166905  0.184502  0.017597
C  0.807706  0.638787  0.329646 -0.309141
D -0.497104 -0.943406  0.484752  1.428158

In [81]:
df

          W         Y         Z         O
A  0.302665 -1.706086 -1.159119  0.546967
B -0.134841  0.166905  0.184502  0.017597
C  0.807706  0.638787  0.329646 -0.309141
D -0.497104 -0.943406  0.484752  1.428158

In [85]:
df.reset_index(drop=True,inplace=True)

In [86]:
df

          W         Y         Z         O
0  0.302665 -1.706086 -1.159119  0.546967
1 -0.134841  0.166905  0.184502  0.017597
2  0.807706  0.638787  0.329646 -0.309141
3 -0.497104 -0.943406  0.484752  1.428158

In [87]:
df.set_index(['Z','Y'])

                            W         O
Z         Y
-1.159119 -1.706086  0.302665  0.546967
 0.184502  0.166905 -0.134841  0.017597
 0.329646  0.638787  0.807706 -0.309141
 0.484752 -0.943406 -0.497104  1.428158

In [91]:
df['States'] = ['BDG', 'TGS', 'JKT', 'SBY']

In [89]:
df

          W         Y         Z         O States
0  0.302665 -1.706086 -1.159119  0.546967    BDG
1 -0.134841  0.166905  0.184502  0.017597    TGS
2  0.807706  0.638787  0.329646 -0.309141    JKT
3 -0.497104 -0.943406  0.484752  1.428158    SBY

In [92]:
df.set_index('States', inplace=True)

In [93]:
df

               W         Y         Z         O
States
BDG     0.302665 -1.706086 -1.159119  0.546967
TGS    -0.134841  0.166905  0.184502  0.017597
JKT     0.807706  0.638787  0.329646 -0.309141
SBY    -0.497104 -0.943406  0.484752  1.428158

In [102]:
df.set_index(pd.Index(df['States'].tolist())).drop('States',axis=1)

KeyError: 'States'

In [109]:
df.reset_index(inplace=True)

In [111]:
df['States']

0    BDG
1    TGS
2    JKT
3    SBY
Name: States, dtype: object

In [112]:
df['States'].tolist()

['BDG', 'TGS', 'JKT', 'SBY']

In [114]:
df.set_index(pd.Index(df['States'].tolist())).drop('States',axis=1)

            W         Y         Z         O
BDG  0.302665 -1.706086 -1.159119  0.546967
TGS -0.134841  0.166905  0.184502  0.017597
JKT  0.807706  0.638787  0.329646 -0.309141
SBY -0.497104 -0.943406  0.484752  1.428158

In [115]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
# Memasangkan element antar list
hier_index = pd.MultiIndex.from_tuples(hier_index)
# Supaya index bertingkat

In [116]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [117]:
for i in zip(outside,inside):
    print(i)

('G1', 1)
('G1', 2)
('G1', 3)
('G2', 1)
('G2', 2)
('G2', 3)

In [118]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [135]:
df = pd.DataFrame(np.random.randn(6,2),
                  index=hier_index,
                  columns=['A','B'])

In [121]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [122]:
df.loc['G1']

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [123]:
df.loc[[('G1',2)]]

             A         B
G1 2 -1.136645  0.000366

In [127]:
df.loc['G1'].loc[[1]]

          A       B
1 -0.993263  0.1968

In [129]:
df.index.names = ['Group', 'Num']

In [130]:
df

                  A         B
Group Num
G1    1   -0.993263  0.196800
      2   -1.136645  0.000366
      3    1.025984 -0.156598
G2    1   -0.031579  0.649826
      2    2.154846 -0.610259
      3   -0.755325 -0.346419

In [131]:
df.columns = ['C','D']

In [132]:
df

                  C         D
Group Num
G1    1   -0.993263  0.196800
      2   -1.136645  0.000366
      3    1.025984 -0.156598
G2    1   -0.031579  0.649826
      2    2.154846 -0.610259
      3   -0.755325 -0.346419

In [133]:
df.xs(['G1', 1])

C   -0.993263
D    0.196800
Name: (G1, 1), dtype: float64

In [134]:
df.xs(3, level="Num")
# Untuk memilih "Num 3" di "Group" yang sama

              C         D
Group
G1     1.025984 -0.156598
G2    -0.755325 -0.346419

# Missing Data

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[5,np.nan,np.nan],
                   'C':[1,2,3]})

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()
# nge drop yang ada NaN

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis=1)
# nge drop kolom

   C
0  1
1  2
2  3

In [11]:
df.dropna(thresh=2)
# cari baris yang 'Nan' nya ada 2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [14]:
df.dropna(thresh=2,axis=1)
# kalau kolom tambah 'axis'

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [15]:
df.fillna(value='FILL VALUE')
# mengisi Nan d/ fill value

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [16]:
df['A'].fillna(value=df['A'].mean())
# mengisi baris 2 dengan rataan dari kolom 'A', NaN tidak termasuk dalam rataan
# (1+2+Nan/2(karena yang berangka hanya baris 0 dan 1)=1.5)

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [20]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# Groupby

In [24]:
import pandas as pd
data = {'Company':['GOOG','GOOG','MSFT', 'MSFT','FB', 'FB'],
       "Person":['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [25]:
df = pd.DataFrame(data)

In [26]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [27]:
by_comp = df.groupby('Company')

In [29]:
by_comp.mean()
# rata rata sales perusahaan yang sama

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [30]:
by_comp.describe()
# semua dari sales

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [31]:
by_comp.describe().transpose()
# mengubah baris menjadi kolom

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [34]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [35]:
by_comp.describe().transpose()['GOOG'].loc['Sales'].loc['25%']

140.0

# Merging, Joining, and Concatenating

In [36]:
import pandas as pd

In [37]:
df1 = pd.DataFrame({'A': ['A0','A1','A2','A3'],
                   'B': ['B0','B1','B2','B3'],
                   'C': ['C0','C1','C2','C3'],
                   'D': ['D0','D1','D2','D3']},
                  index=[0,1,2,3])
# cara cepet klik 'ctrl' sama klik yang mau diganti

In [38]:
df2 = pd.DataFrame({'A': ['A4','A5','A6','A7'],
                   'B': ['B4','B5','B6','B7'],
                   'C': ['C4','C5','C6','C7'],
                   'D': ['D4','D5','D6','D7']},
                  index=[4,5,6,7])

In [40]:
df3 = pd.DataFrame({'A': ['A8','A9','A10','A11'],
                   'B': ['B8','B9','B10','B11'],
                   'C': ['C8','D9','C10','C11'],
                   'D': ['D8','D9','D10','D11']},
                  index=[8,9,10,11])

In [41]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [42]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [43]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   D9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [44]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   D9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [45]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

In [46]:
pd.merge(left,right,how='inner',on='key')
# inner = cari yang elemennya di dua data ada
# outer = seluruh elemen

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [51]:
pd.merge(left,right,how='left',on=['key1','key2'])

                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

In [52]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [53]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [54]:
pd.merge(left,right,on=['key1','key2'])
# kalau gaada how, maka defaultnya inner

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [56]:
pd.merge(left,right,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [57]:
pd.merge(left,right,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [60]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                    'B': ['B0', 'B1', 'B2']},
                     index=['K0','K1','K2'])
                     
right = pd.DataFrame({'C': ['C0', 'C1', 'C2'],
                    'D': ['D0', 'D1', 'D2']},
                     index=['K0','K2','K3'])

In [61]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [62]:
right

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [63]:
left.join(right)
# melihat index yang sama

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [64]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

# Operations

In [78]:
import pandas as pd
df= pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,555,666,777],
                 'col3':['abc','def','ghi','xyz']})
df.head()
# head = u/ memunculkan data dan baris

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [75]:
df['col2'].unique()
# u/ mencari elemen unik

array([444, 555, 666], dtype=int64)

In [68]:
df['col2'].nunique()
# ada berapa banyak elemen unik

4

In [86]:
newdf = df[(df['col1']) > 2 & (df['col2'] == 444)]

In [87]:
newdf

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [89]:
(df['col2']) == 444 & (df['col1'] > 2)

0    False
1    False
2    False
3    False
dtype: bool

In [88]:
df[(df['col2']) == 444 & (df['col1'] > 2)]
# untuk mengubah data type boolean menjadi keliatan

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [79]:
def times2(x):
    return x**2

In [80]:
df['col1'].apply(times2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [83]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [95]:
del df['col3']
# permanen = del
# semi = drop

KeyError: 'col3'

In [97]:
df

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   777

In [115]:
df.columns = ['col1','col2']

In [116]:
df.columns

Index(['col1', 'col2'], dtype='object')

In [117]:
df

     col1  col2
100     1   444
200     2   555
300     3   666
400     4   777

In [101]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [105]:
df.index = ['100','200','300','400']
# ganti nama index

In [103]:
df

     liverpool  tottenham
100          1        444
200          2        555
300          3        666
400          4        777

In [119]:
df.sort_values(by='col2')

     col1  col2
100     1   444
200     2   555
300     3   666
400     4   777

In [120]:
df.isnull()

      col1   col2
100  False  False
200  False  False
300  False  False
400  False  False

In [121]:
import numpy as np

In [122]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                  'col2':[np.nan,555,666,444],
                  'col3':['abc','def','ghi','xyz']})

In [123]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [124]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [126]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
       'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [127]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [128]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])
# bar one x = 4.0/ dibagi banyaknya x

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

In [136]:
import pandas as pd
import os

In [137]:
path = os.getcwd() + '/'

In [138]:
path

'C:\\Users\\GA-HRGA\\Purwadhika/'

In [147]:
df = pd.read_csv(path + 'DataSets/example')

In [148]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [144]:
df = pd.read_excel(path + 'DataSets/Excel_Sample.xlsx')

In [145]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15